# agent-loadout — default toolbelt
# Run: brew bundle
# Or use the interactive installer: npx agent-loadout

# Core
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "bat"
brew "tree"
brew "gh"
brew "fzf"
brew "xh"

# Agent (tools that improve LLM workflows)
brew "shellcheck"
brew "ast-grep"
brew "just"
brew "grex"
brew "sd"
brew "hyperfine"
brew "tokei"
brew "tldr"
brew "biome"
brew "difftastic"
brew "pandoc"
brew "duckdb"
brew "htmlq"
brew "typos-cli"
brew "gum"

# Media (uncomment if needed)
# brew "ffmpeg"
# brew "exiftool"
# brew "imagemagick"

# DX (uncomment if needed)
# brew "eza"
# brew "zoxide"
# brew "git-delta"
# brew "glow"
# brew "mise"
# brew "watchexec"
# brew "mkcert"
# brew "lazygit"
# brew "dust"
# brew "bottom"
# brew "direnv"
# brew "procs"
# brew "uv"
# brew "hexyl"
# brew "taplo"

# Security (uncomment if needed)
# brew "trivy"
# brew "act"
# brew "gitleaks"
# brew "semgrep"
# brew "age"
# brew "doggo"
