# Auto-generated from catalog.ts — macOS only. Run: pnpm brewfile
# Do not edit manually.

# Core
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "bat"
brew "tree"
brew "gh"
brew "fzf"
brew "xh"

# Agent
brew "shellcheck"
brew "ast-grep"
brew "just"
brew "grex"
brew "sd"
brew "hyperfine"
brew "tokei"
brew "tldr"
brew "biome"
brew "difftastic"
brew "pandoc"
brew "duckdb"
brew "htmlq"
brew "typos-cli"
brew "gum"

# Media
brew "ffmpeg"
brew "exiftool"
brew "imagemagick"

# DX
brew "eza"
brew "zoxide"
brew "git-delta"
brew "glow"
brew "mise"
brew "watchexec"
brew "mkcert"
brew "lazygit"
brew "dust"
brew "bottom"
brew "direnv"
brew "procs"
brew "uv"
brew "hexyl"
brew "taplo"

# Security
brew "trivy"
brew "act"
brew "gitleaks"
brew "semgrep"
brew "age"
brew "doggo"
